Repository: yooouuuy/highschool-blog
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar

source: Mohammed El Zin Highschool
ar: ثانوية محمد الزين

source: Search...
ar: بحث...

source: Home
ar: الرئيسية

source: Forums
ar: المنتديات

source: Library
ar: المكتبة

source: Lessons
ar: الدروس

source: Tests
ar: الاختبارات

source: Chat
ar: الدردشة

source: Pending Users
ar: المستخدمون المعلقون

source: Pending Lessons
ar: الدروس المعلقة

source: New Announcement
ar: إعلان جديد

source: Teacher
ar: معلم

source: Dashboard
ar: لوحة التحكم

source: Student
ar: طالب

source: Logout
ar: تسجيل الخروج

source: Login
ar: تسجيل الدخول

source: Register
ar: تسجيل

source: Switch Language
ar: تغيير اللغة

source: Mohammed El Zin Highschool. All rights reserved.
ar: ثانوية محمد الزين. جميع الحقوق محفوظة.

source: Please
ar: الرجاء

source: as a student to participate in your class chat.
ar: كطالب للمشاركة في محادثة صفك.

source: Test
ar: اختبار

source: available
ar: متاح

source: Create New Test
ar: إنشاء اختبار جديد

source: Year
ar: السنة

source: All Years
ar: كل السنوات

source: Stream
ar: الشعبة

source: All Streams
ar: كل الشعب

source: Subject
ar: المادة

source: All Subjects
ar: كل المواد

source: Filter
ar: تصفية

source: Clear
ar: مسح

source: Author:
ar: المؤلف:

source: Take Test
ar: بدء الاختبار

source: Delete this test?
ar: حذف هذا الاختبار؟

source: Delete Test
ar: حذف الاختبار

source: No tests available.
ar: لا توجد اختبارات متاحة.

source: Attached PDF Document
ar: ملف PDF مرفق

source: Download PDF
ar: تحميل PDF

source: Created by:
ar: تم الإنشاء بواسطة:

source: Take Test (Preview)
ar: بدء الاختبار (معاينة)

source: Take Test Now
ar: بدء الاختبار الآن

source: Question
ar: سؤال

source: Add Question
ar: إضافة سؤال

source: Analytics
ar: تحليلات

source: No questions have been added yet.
ar: لم تتم إضافة أي أسئلة بعد.

source: Add First Question
ar: أضف السؤال الأول

source: Back to Tests
ar: العودة للاختبارات

source: Are you sure you want to delete this test?
ar: هل أنت متأكد أنك تريد حذف هذا الاختبار؟

source: Delete this lesson?
ar: حذف هذا الدرس؟

source: Are you sure you want to delete this lesson?
ar: هل أنت متأكد أنك تريد حذف هذا الدرس؟

source: Resource Library
ar: مكتبة الموارد

source: Resource
ar: مورد

source: available for download
ar: متاح للتحميل

source: Upload Resource
ar: رفع مورد

source: Type
ar: النوع

source: All Types
ar: كل الأنواع

source: By:
ar: بواسطة:

source: Download
ar: تحميل

source: Watch
ar: مشاهدة

source: Open Link
ar: فتح الرابط

source: Delete this resource?
ar: حذف هذا المورد؟

source: No resources found matching your criteria.
ar: لم يتم العثور على موارد تطابق معاييرك.

source: Profile
ar: الملف الشخصي

source: Staff
ar: طاقم العمل

source: Contributions
ar: المساهمات

source: Resources
ar: الموارد

source: No lessons uploaded yet.
ar: لم يتم رفع أي دروس بعد.

source: No tests created yet.
ar: لم يتم إنشاء أي اختبارات بعد.

source: No resources shared yet.
ar: لم يتم مشاركة أي موارد بعد.

source: Test in Progress
ar: اختبار قيد التقدم

source: Submit Test Answers
ar: إرسال إجابات الاختبار

source: Abandon Test
ar: تخطي الاختبار

source: Are you sure you want to abandon this test? Your answers will not be saved.
ar: هل أنت متأكد أنك تريد مغادرة الاختبار؟ لن يتم حفظ إجاباتك.

source: Student Dashboard
ar: لوحة تحكم الطالب

source: My Test Results
ar: نتائج اختباراتي

source: Score
ar: النتيجة

source: Date Taken
ar: تاريخ الاختبار

source: Actions
ar: إجراءات

source: View Details
ar: عرض التفاصيل

source: No results found.
ar: لا توجد نتائج.

source: Take a test now!
ar: ابدأ اختباراً الآن!

source: My Pending Contributions
ar: مساهماتي المعلقة

source: These items are waiting to be reviewed and approved by a teacher.
ar: هذه العناصر في انتظار المراجعة والموافقة من قبل معلم.

source: Pending Review
ar: قيد المراجعة

source: You don't have any pending contributions at the moment.
ar: ليس لديك أي مساهمات معلقة حالياً.

source: Pending Content
ar: محتوى معلق

source: Pending Tests
ar: اختبارات معلقة

source: Pending Resources
ar: موارد معلقة

source: Title
ar: العنوان

source: Created At
ar: تاريخ الإنشاء

source: Approve
ar: موافقة

source: No pending lessons.
ar: لا توجد دروس معلقة.

source: No pending tests.
ar: لا توجد اختبارات معلقة.

source: No pending resources.
ar: لا توجد موارد معلقة.

source: Join Our Community
ar: انضم إلى مجتمعنا

source: Create your account to access lessons, tests, and class chats.
ar: أنشئ حسابك للوصول إلى الدروس والاختبارات ومحادثات الفصل.

source: I am joining as a:
ar: سأنضم كـ:

source: Please select either Teacher or Student.
ar: يرجى اختيار إما معلم أو طالب.

source: Academic Info
ar: المعلومات الأكاديمية

source: Validation Errors:
ar: أخطاء التحقق:

source: Read more
ar: اقرأ المزيد

source: ago
ar: منذ

source: Lesson
ar: درس

source: Account Details
ar: تفاصيل الحساب

source: Nickname (Display Name)
ar: اللقب (اسم العرض)

source: How others will see you
ar: كيف سيراك الآخرون

source: Username
ar: اسم المستخدم

source: Choose a username
ar: اختر اسم مستخدم

source: Email Address
ar: البريد الإلكتروني

source: Personal Profile
ar: الملف الشخصي

source: Full Real Name
ar: الاسم الحقيقي الكامل

source: As per official documents
ar: كما هو في المستندات الرسمية

source: Bio (optional)
ar: نبذة (اختياري)

source: Profile Picture (optional)
ar: صورة الملف الشخصي (اختياري)

source: Year Level
ar: المستوى الدراسي

source: Security
ar: الأمان

source: Password
ar: كلمة المرور

source: Min. 8 characters
ar: 8 أحرف على الأقل

source: Confirm Password
ar: تأكيد كلمة المرور

source: Repeat password
ar: كرر كلمة المرور

source: Register Account
ar: تسجيل الحساب

source: Already registered?
ar: مسجل بالفعل؟

source: Log In Here
ar: سجل الدخول هنا

source: 1st Year
ar: السنة الأولى

source: 2nd Year
ar: السنة الثانية

source: 3rd Year
ar: السنة الثالثة

source: Common Science
ar: جذع مشترك علوم

source: Common Literature
ar: جذع مشترك آداب

source: Math Stream
ar: شعبة الرياضيات

source: Science Stream
ar: شعبة العلوم التجريبية

source: Languages Stream
ar: شعبة اللغات الأجنبية

source: Literature Stream
ar: شعبة الآداب والفلسفة

source: Management & Economics Stream
ar: شعبة تسيير واقتصاد

source: Civil Engineering Stream
ar: شعبة هندسة مدنية

source: Mathematics
ar: الرياضيات

source: Physics
ar: الفيزياء

source: SVT (Science)
ar: علوم الطبيعة والحياة

source: Arabic
ar: اللغة العربية

source: French
ar: اللغة الفرنسية

source: English
ar: اللغة الإنجليزية

source: Islamic Studies
ar: العلوم الإسلامية

source: History & Geography
ar: التاريخ والجغرافيا

source: Philosophy
ar: الفلسفة

source: Physical Education
ar: التربية البدنية

source: Test Results
ar: نتائج الاختبار

source: Average Correct Answers
ar: متوسط الإجابات الصحيحة

source: Average Incorrect Answers
ar: متوسط الإجابات الخاطئة

source: Overall Performance
ar: الأداء العام

source: Question Performance
ar: أداء الأسئلة

source: Correct %
ar: نسبة الصحة %

source: Attempts
ar: المحاولات

source: Correct Answers
ar: إجابات صحيحة

source: Incorrect Answers
ar: إجابات خاطئة

source: Total Questions
ar: إجمالي الأسئلة

source: Your Score
ar: درجتك

source: Back to Test List
ar: العودة لقائمة الاختبارات

source: Create Lesson
ar: إنشاء درس

source: Save Lesson
ar: حفظ الدرس

source: Submit for Approval
ar: إرسال للموافقة

source: PDF File (Optional)
ar: ملف PDF (اختياري)

source: Cancel
ar: إلغاء

source: Create Test
ar: إنشاء اختبار

source: Description
ar: الوصف

source: Upload New Resource
ar: رفع مورد جديد

source: Publish Resource
ar: نشر المورد

source: Start New Discussion
ar: بدء مناقشة جديدة

source: Discussion Title
ar: عنوان المناقشة

source: Your Message
ar: رسالتك

source: What's on your mind?
ar: ماذا يدور في ذهنك؟

source: Post Discussion
ar: نشر المناقشة

source: Add Question to:
ar: إضافة سؤال إلى:

source: Create Announcement
ar: إنشاء إعلان

source: Post Announcement
ar: نشر الإعلان

source: Edit Profile
ar: تعديل الملف الشخصي

source: No Pic
ar: لا توجد صورة

source: Real Name
ar: الاسم الحقيقي

source: Real name cannot be changed.
ar: لا يمكن تغيير الاسم الحقيقي.

source: Save Changes
ar: حفظ التغييرات

source: Pending User Approvals
ar: طلبات الموافقة المعلقة

source: Date Joined
ar: تاريخ الانضمام

source: Role
ar: الدور

source: User
ar: مستخدم

source: No pending users.
ar: لا يوجد مستخدمون معلقون.

source: Registration Successful
ar: تم التسجيل بنجاح

source: Thank you for registering at <strong>Mohammed El Zin Highschool</strong>.
ar: شكراً لتسجيلك في <strong>ثانوية محمد الزين</strong>.

source: Pending Approval
ar: في انتظار الموافقة

source: Your account must be approved by a staff member before you can log in. Please wait for an administrator to review your details.
ar: يجب الموافقة على حسابك من قبل أحد الموظفين قبل أن تتمكن من تسجيل الدخول. يرجى الانتظار حتى يراجع المسؤول تفاصيلك.

source: Search Results
ar: نتائج البحث

source: Results for
ar: نتائج لـ

source: No results found for your query.
ar: لم يتم العثور على نتائج لبحثك.

source: Questions
ar: أسئلة

source: View Test
ar: عرض الاختبار

source: View Link
ar: عرض الرابط

source: Notifications
ar: التنبيهات

source: New
ar: جديد

source: Mark Read
ar: تحديد كمقروء

source: View
ar: عرض

source: No notifications
ar: لا توجد تنبيهات

source: You're all caught up!
ar: أنت مطلع على كل شيء!

source: Option A
ar: الخيار أ

source: Option B
ar: الخيار ب

source: Option C
ar: الخيار ج

source: Option D
ar: الخيار د

source: PDF Document
ar: مستند PDF

source: Video Link
ar: رابط فيديو

source: External Link
ar: رابط خارجي

source: General Discussion
ar: مناقشة عامة

source: Resource Share
ar: مشاركة موارد

source: Correct: Option
ar: الصحيح: الخيار

source: Ordered by difficulty (lowest accuracy first)
ar: مرتبة حسب الصعوبة (الأقل دقة أولاً)

source: Highest Score
ar: أعلى درجة

source: Lowest Score
ar: أقل درجة

source: Students Taken
ar: الطلاب الذين خضعوا للاختبار

source: Average Score
ar: متوسط الدرجات

source: Question Breakdown
ar: تحليل الأسئلة

source: Analytics:
ar: التحليلات:

source: Back to Test
ar: العودة للاختبار

source: No students have taken this test yet.
ar: لم يقم أي طالب بإجراء هذا الاختبار بعد.

source: Q:
ar: س:

source: Your full real name (cannot be changed later).
ar: اسمك الحقيقي الكامل (لا يمكن تغييره لاحقاً).

source: A display name you can change.
ar: اسم عرض يمكنك تغييره.

source: Optional profile picture.
ar: صورة ملف شخصي اختيارية.

source: Select your year level (for students only).
ar: اختر مستواك الدراسي (للطلاب فقط).

source: Your academic stream (1st: Common Sci/Lit, 2nd/3rd: specialized streams).
ar: شعبتك الأكاديمية (السنة الأولى: مشترك ع/آ، الثانية/الثالثة: شعب مختصة).

source: This name will be displayed to others.
ar: سيظهر هذا الاسم للآخرين.

source: Tell us a bit about yourself.
ar: أخبرنا قليلاً عن نفسك.

source: You must upload a PDF file.
ar: يجب تحميل ملف PDF.

source: You must provide a URL.
ar: يجب توفير رابط URL.

source: Write your reply...
ar: اكتب ردك...

source: Ask a question or leave a comment...
ar: اطرح سؤالاً أو اترك تعليقاً...

source: Clear Chat
ar: مسح الدردشة

source: Chat Room
ar: غرفة الدردشة

source: Clear my chat history
ar: مسح سجل الدردشة الخاص بي

source: Loading messages...
ar: جاري تحميل الرسائل...

source: Type your message...
ar: اكتب رسالتك...

source: Are you sure you want to clear your chat history? This cannot be undone.
ar: هل أنت متأكد أنك تريد مسح سجل الدردشة؟ لا يمكن التراجع عن هذا الإجراء.

source: Chat history cleared.
ar: تم مسح سجل الدردشة.

source: Failed to clear chat history.
ar: فشل مسح سجل الدردشة.

source: Edit
ar: تعديل

source: Delete
ar: حذف

source: Save
ar: حفظ

source: Edit failed:
ar: فشل التعديل:

source: Are you sure you want to delete this message?
ar: هل أنت متأكد أنك تريد حذف هذه الرسالة؟

source: Delete failed:
ar: فشل الحذف:

source: No messages yet. Be the first to say something!
ar: لا توجد رسائل بعد. كن أول من يتحدث!

source: Failed to send message:
ar: فشل إرسال الرسالة:

source: Error sending message. Please try again.
ar: خطأ في إرسال الرسالة. يرجى المحاولة مرة أخرى.

source: Class Chat
ar: محادثة الفصل

source: Open Full Chat
ar: فتح الدردشة الكاملة

source: Started by
ar: بدأ بواسطة

source: Access denied. Check your year/stream settings.
ar: تم رفض الوصول. تحقق من إعدادات السنة/الشعبة الخاصة بك.

source: Failed to load chat.
ar: فشل تحميل الدردشة.

source: Delete this announcement?
ar: حذف هذا الإعلان؟

source: School Announcements
ar: إعلانات المدرسة

source: Recent Lessons
ar: أحدث الدروس

source: Recent Tests
ar: أحدث الاختبارات

source: Library Resources
ar: موارد المكتبة

source: Post a Reply
ar: أضف رداً

source: Submit Reply
ar: إرسال الرد

source: Delete Thread
ar: حذف الموضوع

source: Delete this entire discussion?
ar: حذف هذه المناقشة بالكامل؟

source: Page Not Found
ar: الصفحة غير موجودة

source: The page you are looking for might have been removed, had its name changed, or is temporarily unavailable.
ar: الصفحة التي تبحث عنها قد تكون حذفت، تم تغيير اسمها، أو غير متاحة مؤقتاً.

source: Back to Home
ar: العودة للرئيسية

source: Internal Server Error
ar: خطأ داخلي في الخادم

source: Something went wrong on our end. We're working on fixing it. Please try again later.
ar: حدث خطأ ما من جانبنا. نحن نعمل على إصلاحه. يرجى المحاولة مرة أخرى لاحقاً.

source: Subject Forums
ar: منتديات المواد

source: View Threads
ar: عرض المواضيع

source: No lessons available.
ar: لا توجد دروس متاحة.

source: No tests are available at the moment.
ar: لا توجد اختبارات متاحة في الوقت الحالي.

source: No announcements are available at the moment.
ar: لا توجد إعلانات متاحة في الوقت الحالي.

source: Welcome Back
ar: مرحباً بعودتك

source: Please enter your credentials
ar: يرجى إدخال بيانات الاعتماد الخاصة بك

source: Your username
ar: اسم المستخدم الخاص بك

source: Your password
ar: كلمة المرور الخاصة بك

source: Don't have an account?
ar: ليس لديك حساب؟

source: Create one now
ar: أنشئ حساباً الآن

source: First Year
ar: السنة الأولى

source: Second Year
ar: السنة الثانية

source: Third Year
ar: السنة الثالثة

source: Civil Engineering
ar: الهندسة المدنية

source: Accounting
ar: المحاسبة

source: Law
ar: القانون

source: Economy
ar: الاقتصاد

source: German
ar: اللغة الألمانية

source: Spanish
ar: اللغة الإسبانية

source: Welcome to Mohammed El Zin Highschool
ar: مرحباً بكم في ثانوية محمد الزين

source: Your platform for interactive learning and assessment. Explore lessons and take tests to improve your knowledge.
ar: منصتك للتعلم التفاعلي والتقييم. استكشف الدروس وقم بإجراء الاختبارات لتحسين معارفك.

source: View All
ar: عرض الكل

source: Discussion forum for %(label)s
ar: منتدى النقاش لـ %(label)s

source: No lessons found.
ar: لم يتم العثور على دروس.

source: Science
ar: العلوم

source: Math
ar: الرياضيات

source: Create New Lesson
ar: إنشاء درس جديد
